fluid/cases/NASAsc2_0410_motorBike/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-6 -5 -7.525)
    (16 -5 -7.525)
    (16  5 -7.525)
    (-6  5 -7.525)
    (-6 -5 10.475)
    (16 -5 10.475)
    (16  5 10.475)
    (-6  5 10.475)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (50 20 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (4 5 6 7) // (3 7 6 2)
            (0 3 2 1) // (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type patch;
        faces
        (
            (1 5 4 0) // (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (3 7 6 2) // (4 5 6 7)
        );
    }
);


// ************************************************************************* //
